libxmlbus/data/wsaddr-testset/documents/notify/soap12/message8.xml

<?xml version='1.0' ?>
<!-- $Id: message8.xml,v 1.6 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:To>http://example.org/node/A</wsa:To>
  <wsa:Action>http://example.org/action/notify</wsa:Action>
  <wsa:ReplyTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address>
   <wsa:Metadata>
	<definitions xmlns="http://schemas.xmlsoap.org/wsdl/">
		<!-- TBD: insert WSDL 1.1 here! -->
	</definitions>
	<description xmlns="http://www.w3.org/2006/01/wsdl">
		<!-- TBD: insert WSDL 2.0 here! -->
	</description>
   </wsa:Metadata>
  </wsa:ReplyTo>
 </env:Header>
 <env:Body>
  <m:notify xmlns:m="http://example.org/notify">Message 2</m:notify>
 </env:Body>
</env:Envelope>
